In [154]:
#import libraries
import pandas as pd  
# test

In [155]:
#load CSV files
app_record_df = pd.read_csv("application_record.csv")

credit_record_df = pd.read_csv("credit_record.csv")

In [156]:
#explore the dataset

app_record_df.head()

,ID,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,AMT_INCOME_TOTAL,NAME_INCOME_TYPE,NAME_EDUCATION_TYPE,NAME_FAMILY_STATUS,NAME_HOUSING_TYPE,DAYS_BIRTH,DAYS_EMPLOYED,FLAG_MOBIL,FLAG_WORK_PHONE,FLAG_PHONE,FLAG_EMAIL,OCCUPATION_TYPE,CNT_FAM_MEMBERS
0,5008804,M,Y,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,1,1,0,0,NaN,2.0
1,5008805,M,Y,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,1,1,0,0,NaN,2.0
2,5008806,M,Y,Y,0,112500.0,Working,Secondary / secondary special,Married,House / apartment,-21474,-1134,1,0,0,0,Security staff,2.0
3,5008808,F,N,Y,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-19110,-3051,1,0,1,1,Sales staff,1.0
4,5008809,F,N,Y,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-19110,-3051,1,0,1,1,Sales staff,1.0

In [157]:
credit_record_df.head()

        ID  MONTHS_BALANCE STATUS
0  5001711               0      X
1  5001711              -1      0
2  5001711              -2      0
3  5001711              -3      0
4  5001712               0      C

In [158]:
app_record_df.info()
credit_record_df.info()

app_record_df.isna().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 438557 entries, 0 to 438556
Data columns (total 18 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   ID                   438557 non-null  int64
 1   CODE_GENDER          438557 non-null  object
 2   FLAG_OWN_CAR         438557 non-null  object
 3   FLAG_OWN_REALTY      438557 non-null  object
 4   CNT_CHILDREN         438557 non-null  int64
 5   AMT_INCOME_TOTAL     438557 non-null  float64
 6   NAME_INCOME_TYPE     438557 non-null  object
 7   NAME_EDUCATION_TYPE  438557 non-null  object
 8   NAME_FAMILY_STATUS   438557 non-null  object
 9   NAME_HOUSING_TYPE    438557 non-null  object
 10  DAYS_BIRTH           438557 non-null  int64
 11  DAYS_EMPLOYED        438557 non-null  int64
 12  FLAG_MOBIL           438557 non-null  int64
 13  FLAG_WORK_PHONE      438557 non-null  int64
 14  FLAG_PHONE           438557 non-null  int64
 15  FLAG_EMAIL           438557 non-null  int64
 16  OCCUPATION_TYPE      304354 non-null  object
 17  CNT_FAM_MEMBERS      438557 non-null  float64
dtypes: float64(2), int64(8), object(8)
memory usage: 60.2+ MB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1048575 entries, 0 to 1048574
Data columns (total 3 columns):
 #   Column          Non-Null Count    Dtype
---  ------          --------------    -----
 0   ID              1048575 non-null  int64
 1   MONTHS_BALANCE  1048575 non-null  int64
 2   STATUS          1048575 non-null  object
dtypes: int64(2), object(1)
memory usage: 24.0+ MB

ID                          0
CODE_GENDER                 0
FLAG_OWN_CAR                0
FLAG_OWN_REALTY             0
CNT_CHILDREN                0
AMT_INCOME_TOTAL            0
NAME_INCOME_TYPE            0
NAME_EDUCATION_TYPE         0
NAME_FAMILY_STATUS          0
NAME_HOUSING_TYPE           0
DAYS_BIRTH                  0
DAYS_EMPLOYED               0
FLAG_MOBIL                  0
FLAG_WORK_PHONE             0
FLAG_PHONE                  0
FLAG_EMAIL                  0
OCCUPATION_TYPE        134203
CNT_FAM_MEMBERS             0
dtype: int64

In [159]:
credit_record_df.isna().sum()

ID                0
MONTHS_BALANCE    0
STATUS            0
dtype: int64

In [160]:
app_record_df.isnull().sum()

ID                          0
CODE_GENDER                 0
FLAG_OWN_CAR                0
FLAG_OWN_REALTY             0
CNT_CHILDREN                0
AMT_INCOME_TOTAL            0
NAME_INCOME_TYPE            0
NAME_EDUCATION_TYPE         0
NAME_FAMILY_STATUS          0
NAME_HOUSING_TYPE           0
DAYS_BIRTH                  0
DAYS_EMPLOYED               0
FLAG_MOBIL                  0
FLAG_WORK_PHONE             0
FLAG_PHONE                  0
FLAG_EMAIL                  0
OCCUPATION_TYPE        134203
CNT_FAM_MEMBERS             0
dtype: int64

In [161]:
credit_record_df.isnull().sum()

ID                0
MONTHS_BALANCE    0
STATUS            0
dtype: int64

In [162]:
#check if there are duplicate record
print ( "The number of unique record for application record = " + str(app_record_df["ID"].nunique() ))
print ( "The number of unique record for credit record = " + str(credit_record_df["ID"].nunique() ))

The number of unique record for application record = 438510
The number of unique record for credit record = 45985

In [163]:
# check  how many records match in two csv files

print( "The number of common record = " + str(len(set(credit_record_df["ID"]).intersection(set(app_record_df['ID'])))))

The number of common record = 36457

In [164]:
#start cleaning the data

In [165]:
#drop duplicate record
app_record_df_clean = app_record_df.drop_duplicates(subset=['ID'])
credit_record_df_clean = credit_record_df.drop_duplicates(subset=['ID'])

In [166]:
app_record_df_clean.info()
credit_record_df_clean.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 438510 entries, 0 to 438556
Data columns (total 18 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   ID                   438510 non-null  int64
 1   CODE_GENDER          438510 non-null  object
 2   FLAG_OWN_CAR         438510 non-null  object
 3   FLAG_OWN_REALTY      438510 non-null  object
 4   CNT_CHILDREN         438510 non-null  int64
 5   AMT_INCOME_TOTAL     438510 non-null  float64
 6   NAME_INCOME_TYPE     438510 non-null  object
 7   NAME_EDUCATION_TYPE  438510 non-null  object
 8   NAME_FAMILY_STATUS   438510 non-null  object
 9   NAME_HOUSING_TYPE    438510 non-null  object
 10  DAYS_BIRTH           438510 non-null  int64
 11  DAYS_EMPLOYED        438510 non-null  int64
 12  FLAG_MOBIL           438510 non-null  int64
 13  FLAG_WORK_PHONE      438510 non-null  int64
 14  FLAG_PHONE           438510 non-null  int64
 15  FLAG_EMAIL           438510 non-null  int64
 16  OCCUPATION_TYPE      304317 non-null  object
 17  CNT_FAM_MEMBERS      438510 non-null  float64
dtypes: float64(2), int64(8), object(8)
memory usage: 63.6+ MB
<class 'pandas.core.frame.DataFrame'>
Int64Index: 45985 entries, 0 to 1048545
Data columns (total 3 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   ID              45985 non-null  int64
 1   MONTHS_BALANCE  45985 non-null  int64
 2   STATUS          45985 non-null  object
dtypes: int64(2), object(1)
memory usage: 1.4+ MB

In [167]:
# we have seen occupation type has 134203 record with NULL/NA, we should drop this column as no meaningful insight 
#can be generated from this data attribute
app_record_df_clean.drop('OCCUPATION_TYPE', axis=1, inplace=True)

/Users/Scottie/opt/anaconda3/lib/python3.9/site-packages/pandas/core/frame.py:4906: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().drop(

In [168]:
app_record_df_clean.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 438510 entries, 0 to 438556
Data columns (total 17 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   ID                   438510 non-null  int64
 1   CODE_GENDER          438510 non-null  object
 2   FLAG_OWN_CAR         438510 non-null  object
 3   FLAG_OWN_REALTY      438510 non-null  object
 4   CNT_CHILDREN         438510 non-null  int64
 5   AMT_INCOME_TOTAL     438510 non-null  float64
 6   NAME_INCOME_TYPE     438510 non-null  object
 7   NAME_EDUCATION_TYPE  438510 non-null  object
 8   NAME_FAMILY_STATUS   438510 non-null  object
 9   NAME_HOUSING_TYPE    438510 non-null  object
 10  DAYS_BIRTH           438510 non-null  int64
 11  DAYS_EMPLOYED        438510 non-null  int64
 12  FLAG_MOBIL           438510 non-null  int64
 13  FLAG_WORK_PHONE      438510 non-null  int64
 14  FLAG_PHONE           438510 non-null  int64
 15  FLAG_EMAIL           438510 non-null  int64
 16  CNT_FAM_MEMBERS      438510 non-null  float64
dtypes: float64(2), int64(8), object(7)
memory usage: 60.2+ MB

In [169]:
app_record_df_clean.head()

,ID,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,AMT_INCOME_TOTAL,NAME_INCOME_TYPE,NAME_EDUCATION_TYPE,NAME_FAMILY_STATUS,NAME_HOUSING_TYPE,DAYS_BIRTH,DAYS_EMPLOYED,FLAG_MOBIL,FLAG_WORK_PHONE,FLAG_PHONE,FLAG_EMAIL,CNT_FAM_MEMBERS
0,5008804,M,Y,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,1,1,0,0,2.0
1,5008805,M,Y,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,1,1,0,0,2.0
2,5008806,M,Y,Y,0,112500.0,Working,Secondary / secondary special,Married,House / apartment,-21474,-1134,1,0,0,0,2.0
3,5008808,F,N,Y,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-19110,-3051,1,0,1,1,1.0
4,5008809,F,N,Y,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-19110,-3051,1,0,1,1,1.0

In [178]:
replace_dict_gender= {'M':1,'F':0}
replace_dict_yes_no = {'Y':1,'N':0}


app_record_df_clean2 = app_record_df_clean.copy()

app_record_df_clean2['CODE_GENDER']=app_record_df_clean2['CODE_GENDER'].map(replace_dict_gender)
app_record_df_clean2['FLAG_OWN_CAR']=app_record_df_clean2['FLAG_OWN_CAR'].map(replace_dict_yes_no)
app_record_df_clean2['FLAG_OWN_REALTY']=app_record_df_clean2['FLAG_OWN_REALTY'].map(replace_dict_yes_no)

#app_record_df_clean2 = app_record_df_clean.copy()
#qpp_record_df_clean2['CODE_GENDER'].replace(0, 'F',inplace=True)
#app_record_df_clean2['CODE_GENDER'].replace(1, 'M',inplace=True)

In [179]:
app_record_df_clean2.head()

,ID,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,AMT_INCOME_TOTAL,NAME_INCOME_TYPE,NAME_EDUCATION_TYPE,NAME_FAMILY_STATUS,NAME_HOUSING_TYPE,DAYS_BIRTH,DAYS_EMPLOYED,FLAG_MOBIL,FLAG_WORK_PHONE,FLAG_PHONE,FLAG_EMAIL,CNT_FAM_MEMBERS
0,5008804,1,1,1,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,1,1,0,0,2.0
1,5008805,1,1,1,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,1,1,0,0,2.0
2,5008806,1,1,1,0,112500.0,Working,Secondary / secondary special,Married,House / apartment,-21474,-1134,1,0,0,0,2.0
3,5008808,0,0,1,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-19110,-3051,1,0,1,1,1.0
4,5008809,0,0,1,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-19110,-3051,1,0,1,1,1.0